---
kind: method
id: M:Autodesk.Revit.DB.UpdaterRegistry.Dispose
source: html/ebefe6a7-21e0-92f8-f196-77a4e4de8012.htm
---
# Autodesk.Revit.DB.UpdaterRegistry.Dispose Method

Releases all resources used by the UpdaterRegistry

## Syntax (C#)
```csharp
public void Dispose()
```